## The aim of this project is to analyse trends resulting from growing prosperity of different countries. The dataset used was published and collected from (https://www.gapminder.org/data/). Different factors and data will be used for measurement such as :
* Electricity use per person
* Income per Capita (PPP)
* Gross Domestic Product (GDP, measured as PPP)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from functools import reduce
%matplotlib inline

## **Data Wrangling**

In [2]:
# Read in the datasets
# GDP by Purchasing Power Parity (PPP)
df_gdp = pd.read_csv("total_gdp_ppp_inflation_adjusted.csv")
# Citizen Income Per Capita $ Purchasing Power Parity (PPP)
df_income = pd.read_csv("income_per_person_gdppercapita_ppp_inflation_adjusted.csv")
# Electricity consumption per person
df_electricity = pd.read_csv("electricity_use_per_person.csv")
# Number of cellphones owned per 100 people
df_cellphones = pd.read_csv("cell_phones_per_100_people.csv")
# % of internet users by country
df_internet = pd.read_csv("internet_users.csv")
# Total annual oil consumption per country
df_oil = pd.read_csv("oil_consumption_total.csv")

In [3]:
# df_gdp.head(-5)
# df_income.head(-5)
# df_electricity.head(-5)
# df_cellphones.head(-5)
# df_internet.head(-5)
# df_oil.head(-5)

### It was observed that some countries and years has missing data. This could be attributed to the fact that data was either not available, or collected for a particular country in a year. Melft function will be used to turn data into a more analysable.

In [4]:
# Measures the Total Country GDP (in PPP)
# Using Melt to reshape the data to show country in the first column, followed by the year and GDP
df_gdp2 = pd.melt(df_gdp, id_vars="country", var_name="year", value_name="gdp")
df_gdp2

           country  year           gdp
0      Afghanistan  1800  2.080000e+09
1          Albania  1800  3.260000e+08
2          Algeria  1800  3.810000e+09
3          Andorra  1800  3.340000e+06
4           Angola  1800  1.020000e+09
...            ...   ...           ...
41511    Venezuela  2013  5.320000e+11
41512      Vietnam  2013  4.650000e+11
41513        Yemen  2013  1.090000e+11
41514       Zambia  2013  4.400000e+10
41515     Zimbabwe  2013  1.930000e+10

[41516 rows x 3 columns]

In [5]:
# Measures the Income Per Capita (in PPP)
# Using Melt to reshape the data to show country in the first column, followed by the year and income
df_income2 = pd.melt(df_income, id_vars="country", var_name="year", value_name="income")
df_income2

           country  year  income
0      Afghanistan  1800     603
1          Albania  1800     667
2          Algeria  1800     715
3          Andorra  1800    1200
4           Angola  1800     618
...            ...   ...     ...
46508    Venezuela  2040    9880
46509      Vietnam  2040   14400
46510        Yemen  2040    3870
46511       Zambia  2040    4180
46512     Zimbabwe  2040    3140

[46513 rows x 3 columns]

In [6]:
# Measures electricity use Per Person
# This measures the electricity production of power plants and combined heat (i.e. energy not lost during transmission)
# Using Melt to reshape the data to show country in the first column, followed by the year and electricity consumption
df_electricity2 = pd.melt(df_electricity, id_vars="country", var_name="year", value_name="electricity_consumption")
df_electricity2

        country  year  electricity_consumption
0       Albania  1960                      NaN
1       Algeria  1960                      NaN
2        Angola  1960                      NaN
3     Argentina  1960                      NaN
4       Armenia  1960                      NaN
...         ...   ...                      ...
7585  Venezuela  2014                   2720.0
7586    Vietnam  2014                   1420.0
7587      Yemen  2014                    220.0
7588     Zambia  2014                    717.0
7589   Zimbabwe  2014                    609.0

[7590 rows x 3 columns]

In [7]:
# Measures the number of Cell Phone subscriptions (per 100 people)
# This is referring to the number of cell phone subscriptions
# Using Melt to reshape the data to show country in the first column, followed by the year and number of cellphones
df_cellphones2 = pd.melt(df_cellphones, id_vars="country", var_name="year", value_name="no_of_cellphones")
df_cellphones2

           country  year  no_of_cellphones
0      Afghanistan  1960               0.0
1          Albania  1960               0.0
2          Algeria  1960               0.0
3          Andorra  1960               0.0
4           Angola  1960               0.0
...            ...   ...               ...
11441    Venezuela  2018              71.8
11442      Vietnam  2018             147.0
11443        Yemen  2018              53.7
11444       Zambia  2018              89.2
11445     Zimbabwe  2018              89.4

[11446 rows x 3 columns]

In [8]:
# This measures the total % of the country population that have an active internet connection
# Using Melt to reshape the data to show country in the first column, followed by the year and % of internet users
# by country
df_internet2 = pd.melt(df_internet, id_vars="country", var_name="year", value_name="percent_internet_users")
df_internet2

           country  year  percent_internet_users
0      Afghanistan  1960                     NaN
1          Albania  1960                     NaN
2          Algeria  1960                     NaN
3          Andorra  1960                     NaN
4           Angola  1960                     NaN
...            ...   ...                     ...
11441    Venezuela  2018                     NaN
11442      Vietnam  2018                    70.3
11443        Yemen  2018                     NaN
11444       Zambia  2018                    14.3
11445     Zimbabwe  2018                     NaN

[11446 rows x 3 columns]

In [9]:
# Measures the total amount of crude Oil consumption in tonnes
# Using Melt to reshape the data to show country in the first column, followed by the year and % of internet users
# by country
df_oil2 = pd.melt(df_oil, id_vars="country", var_name="year", value_name="oil_consumption")
df_oil2

             country  year  oil_consumption
0            Algeria  1965        1290000.0
1          Argentina  1965       22100000.0
2          Australia  1965       15100000.0
3            Austria  1965        5560000.0
4         Azerbaijan  1965              NaN
...              ...   ...              ...
3375  United Kingdom  2016       73100000.0
3376   United States  2016      863000000.0
3377      Uzbekistan  2016        2760000.0
3378       Venezuela  2016       28700000.0
3379         Vietnam  2016       20100000.0

[3380 rows x 3 columns]